blog/solving-docker-permission-denied-while-trying-to-connect-to-the-docker-daemon-socket.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-22 Wed 14:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Solving Docker permission denied while trying to connect to the Docker daemon socket</title>
<meta name="author" content="Uli Köhler" />
<meta name="generator" content="Org Mode" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Solving Docker permission denied while trying to connect to the Docker daemon socket</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfa82f3a">1. Problem:</a></li>
<li><a href="#org1ae7652">2. Solution:</a></li>
<li><a href="#org5abbeb8">3. Source</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgfa82f3a" class="outline-2">
<h2 id="orgfa82f3a"><span class="section-number-2">1.</span> Problem:</h2>
<div class="outline-text-2" id="text-1">
<p>
You are trying to run a docker container or do the docker tutorial, but you only get an error message like this:
</p>
<pre class="example" id="org518e333">
docker: Got permission denied while trying to connect to the Docker daemon socket at unix:///var/run/docker.sock: Post http://%2Fvar%2Frun%2Fdocker.sock/v1.26/containers/create: dial unix /var/run/docker.sock: connect: permission denied.
See 'docker run --help'.
</pre>
</div>
</div>

<div id="outline-container-org1ae7652" class="outline-2">
<h2 id="org1ae7652"><span class="section-number-2">2.</span> Solution:</h2>
<div class="outline-text-2" id="text-2">
<p>
The error message tells you that your current user can’t access the docker engine, because you’re lacking permissions to access the unix socket to communicate with the engine.
</p>

<p>
As a temporary solution, you can use sudo to run the failed command as root.
However it is recommended to fix the issue by adding the current user to the docker group:
</p>

<p>
Run this command in your favourite shell and then <b>completely log out of your account and log back in</b> (if in doubt, reboot!):
</p>
<pre class="example" id="orgbadc6f8">
sudo usermod -a -G docker $USER
</pre>

<p>
After doing that, you should be able to run the command without any issues. Run docker run hello-world as a normal user in order to check if it works. Reboot if the issue still persists.
</p>

<p>
Logging out and logging back in is required because the group change will not have an effect unless your session is closed.
</p>
</div>
</div>

<div id="outline-container-org5abbeb8" class="outline-2">
<h2 id="org5abbeb8"><span class="section-number-2">3.</span> Source</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://techoverflow.net/2017/03/01/solving-docker-permission-denied-while-trying-to-connect-to-the-docker-daemon-socket/">techoverflow</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>
